emacs/.config/emacs/config/utilities/README.org
#+TITLE: Utilities config
#+AUTHOR: umi
#+STARTUP: overview

* CONFIG RELATED
** Keybinds

#+begin_src emacs-lisp
  (leader-key
  "." '((lambda () (interactive) (load-file user-init-file)) :wk "Reload config"))
#+end_src

* CODE EVALUATION
** Keybinds

#+begin_src emacs-lisp
    (leader-key
    "v" '(:ignore t :wk "Evaluate")
    "vb" '(eval-buffer :wk "Evaluate elisp in buffer")
    "vd" '(eval-defun :wk "Evaluate defun containing or after a point")
    "ve" '(eval-expression :wk "Evaluate an elips expression")
    "vr" '(eval-region :wk "Evaluate elisp region"))
#+end_src

* EXPORTING
** Keybinds

  #+begin_src emacs-lisp
      (leader-key
      "x" '(:ignore t :wk "Export")
      "xm" '(org-md-export-as-markdown :wk "Export as markdown"))
#+end_src

* DESCRIBE HELP
** Keybinds

    #+begin_src emacs-lisp
    (leader-key
    "h" '(:ignore t :wk "Help")
    "hf" '(describe-function :wk "Describe function")
    "hv" '(describe-variable :wk "Describe variable"))
#+end_src
